<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"2700e07bd1d32a631cce461065fa9c337fc05fcf831fa9c36677dd111084218b","plan_job_ref":"Job .github/workflows/_test-tf.yaml #33 at https://github.com/DND-IT/github-workflows/actions/runs/14663341519","plan_out_hash":"af0399fcee6269b2fa83f77b2e51a4ce17d4c1a2dd88d86b303e5a658314ec17","plan_hash":"0527d2e6b648d1f9602e4b64e595f902858b688668d63ebe58d9ef59772f75e5","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

  # module.workflow_test_docker_buildx_ecr.aws_ecr_repository.this[0] will be destroyed
  # (because aws_ecr_repository.this is not in configuration)
-   resource "aws_ecr_repository" "this" {
-       arn                  = "arn:aws:ecr:eu-central-1:911453050078:repository/test-docker-buildx-push" -> null
-       id                   = "test-docker-buildx-push" -> null
-       image_tag_mutability = "IMMUTABLE" -> null
-       name                 = "test-docker-buildx-push" -> null
-       registry_id          = "911453050078" -> null
-       repository_url       = "911453050078.dkr.ecr.eu-central-1.amazonaws.com/test-docker-buildx-push" -> null
-       tags                 = {
-           "Usage" = "Automated tests from github-workflows/_test-docker.yaml"
        } -> null
-       tags_all             = {
-           "Usage" = "Automated tests from github-workflows/_test-docker.yaml"
        } -> null

-       encryption_configuration {
-           encryption_type = "AES256" -> null
#            (1 unchanged attribute hidden)
        }

-       image_scanning_configuration {
-           scan_on_push = false -> null
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #33](https://github.com/DND-IT/github-workflows/actions/runs/14663341519)